{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi", 
        "Is anyone there?", 
        "Hello", 
        "Good day",
        "Hey",
        "Greetings",
        "Howdy",
        "What's up?",
        "Hi there",
        "Hey there",
        "Hello there",
        "Good morning",
        "Good afternoon",
        "Good evening"
      ],
      "responses": [
        "Hello! How can I help you today?", 
        "Hi! What can I assist you with?", 
        "Hey! How can I support you?", 
        "Good day! What do you need help with?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye", 
        "See you later", 
        "Goodbye", 
        "Take care",
        "Farewell",
        "Catch you later",
        "See you soon",
        "Later",
        "I'm off",
        "Talk to you later",
        "See ya",
        "Peace out",
        "I'm out",
        "Have a good one"
      ],
      "responses": [
        "Goodbye! Have a great day!", 
        "See you later! Take care!", 
        "Bye! Come back soon!", 
        "Take care! Goodbye!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thanks for the help",
        "I appreciate it",
        "Much appreciated",
        "Thanks a lot",
        "Thank you very much",
        "Thanks for your assistance",
        "Thank you for your help",
        "Thanks for the support",
        "Thank you for the assistance",
        "I am grateful",
        "Many thanks"
      ],
      "responses": [
        "You're welcome! Feel free to ask if you need more assistance.",
        "No problem! Let me know if you have any other questions.",
        "Glad I could help! If you need anything else, just ask.",
        "You're welcome! If you have any other questions, feel free to ask."
      ]
    },
    {
      "tag": "identity",
      "patterns": [
        "What is your name?",
        "Who are you?",
        "What can I call you?",
        "What's your name?",
        "May I know your name?",
        "Who am I chatting with?",
        "Can you tell me your name?",
        "Do you have a name?",
        "What should I call you?",
        "Introduce yourself"
      ],
      "responses": [
        "I am KickSupport!",
        "You can call me KickSupport!",
        "I am KickSupport, your virtual assistant!"
      ]
    },
    {
      "tag": "objectives",
      "patterns": [
        "What are you?",
        "What is your purpose?",
        "What do you do?",
        "What are your objectives?",
        "Support for what?",
        "What is your function?",
        "What is your role?",
        "What can you help me with?",
        "What services do you provide?",
        "What kind of support do you offer?",
        "What is your mission?",
        "What can you assist me with?"
      ],
      "responses": [
        "I am here to help you with KickFlicker",
        "I am here as KickFlicker assistant!",
        "I am here to assist you with KickFlicker!"
      ]
    },
    {
      "tag": "KickFlicker",
      "patterns": [
        "What is KickFlicker?",
        "What can I do with KickFlicker?",
        "What is KickFlicker all about?",
        "Tell me about KickFlicker",
        "Can you explain KickFlicker?",
        "What does KickFlicker do?",
        "How does KickFlicker work?",
        "What services does KickFlicker offer?",
        "What is the purpose of KickFlicker?",
        "What can I use KickFlicker for?"
      ],
      "responses": [
        "KickFlicker is an innovative e-commerce platform where you can find any shoes you need! Our user-friendly interface ensures a smooth shopping experience, and our secure payment options give you peace of mind. Plus, our advanced AI image search categorizes shoes into eight categories: Basket, Boots, Casual, Flat Shoes, Football, Formal, Heels, and Running, making it easier for you to find the perfect pair.",
        "KickFlicker is an e-commerce platform dedicated to shoes! Enjoy a seamless and secure shopping experience with our intuitive interface. Our AI-powered image search helps you categorize shoes into Basket, Boots, Casual, Flat Shoes, Football, Formal, Heels, and Running, ensuring you find exactly what you're looking for.",
        "KickFlicker is an online store for shoes! Our platform offers a friendly and secure shopping environment. With our AI image search, you can easily categorize shoes into eight distinct categories: Basket, Boots, Casual, Flat Shoes, Football, Formal, Heels, and Running, making your shoe shopping quick and efficient."
      ]
    },
    {
      "tag": "sell",
      "patterns": [
        "How can I sell on KickFlicker?",
        "How can I list my shoes on KickFlicker?",
        "How can I sell my shoes on KickFlicker?",
        "How can I become a seller on KickFlicker?",
        "What is the process to sell on KickFlicker?",
        "How do I start selling on KickFlicker?",
        "How do I list products on KickFlicker?",
        "How do I become a seller on KickFlicker?",
        "What do I need to do to sell on KickFlicker?",
        "Can I sell shoes on KickFlicker?",
        "Is it possible to sell on KickFlicker?",
        "How can I register as a seller on KickFlicker?",
        "How can I create a seller account on KickFlicker?",
        "What are the steps to sell on KickFlicker?"
      ],
      "responses": [
        "To start selling on KickFlicker, first create an account by signing up with your email and setting a secure password. After setting up your account, click on the \"My Store\" button at the top of the page to access your seller dashboard. Here, you can manage your store by listing your shoes with detailed descriptions, high-quality images, and competitive prices. Once your products are listed, they will be visible to potential buyers. You can track sales, manage inventory, and communicate with buyers directly through the platform. KickFlicker helps you reach a wide audience and grow your shoe business.",
        "Selling on KickFlicker is easy! Start by creating an account with your email and a secure password. Then, click on the \"My Store\" button at the top of the page to go to your seller dashboard. Here, you can list your shoes with detailed descriptions, high-quality images, and set competitive prices. Your products will be visible to buyers once listed. You can manage your sales, inventory, and communicate with buyers directly through the platform. KickFlicker provides a great opportunity to expand your shoe business.",
        "To sell on KickFlicker, begin by signing up with your email and creating a secure password. Once your account is ready, click on the \"My Store\" button at the top of the page to access your seller dashboard. List your shoes with detailed descriptions, high-quality images, and set competitive prices. Your products will be available to buyers once listed. You can track sales, manage inventory, and communicate with buyers directly through the platform. KickFlicker makes it simple to reach a broad audience and grow your shoe business."
      ]
    },
    {
      "tag": "features",
      "patterns": [
        "What are the features of KickFlicker?",
        "What can I do on KickFlicker?",
        "What are the functionalities of KickFlicker?",
        "What are the services provided by KickFlicker?"
      ],
      "responses": [
        "Like any other e-commerce platform, you can buy and sell products on KickFlicker, but we specialize in shoes! Our platform offers a user-friendly interface and secure payment options. One of our standout features is the AI-powered image search, which categorizes shoes into eight categories: Basket, Boots, Casual, Flat Shoes, Football, Formal, Heels, and Running. This makes it easy for you to find exactly what you're looking for. Whether you're a buyer or a seller, KickFlicker provides a seamless and efficient shopping experience tailored specifically for shoe enthusiasts.",
        "KickFlicker offers a range of features to enhance your shopping experience. You can browse and purchase shoes with ease, thanks to our intuitive interface and secure payment methods. Our AI image search categorizes shoes into Basket, Boots, Casual, Flat Shoes, Football, Formal, Heels, and Running, making it simple to find the perfect pair. Additionally, sellers can list their products and reach a wide audience, ensuring a smooth and efficient transaction process.",
        "On KickFlicker, you can enjoy a variety of features designed to make your shopping experience enjoyable and hassle-free. Our platform allows you to buy and sell shoes with confidence, using secure payment options and a user-friendly interface. The AI-powered image search helps you categorize shoes into eight distinct categories, ensuring you find exactly what you need. Whether you're looking to purchase or sell, KickFlicker has you covered with a seamless and efficient process."
      ]
    },
    {
      "tag": "where",
      "patterns": [
        "Where can I find KickFlicker?",
        "Where is KickFlicker located?",
        "Where can I access KickFlicker?",
        "Where can I use KickFlicker?",
        "How do I get to KickFlicker?",
        "Where can I visit KickFlicker?",
        "Where is the KickFlicker website?",
        "What is the URL for KickFlicker?",
        "How can I reach KickFlicker online?",
        "Where can I go to use KickFlicker?"
      ],
      "responses": [
        "Check out KickFlicker at kickflicker.kisenaa.me!",
        "You can find KickFlicker at kickflicker.kisenaa.me!"
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "I need help",
        "Can you help me?",
        "I need assistance",
        "I need support"
      ],
      "responses": [
        "Sure! What do you need help with?",
        "Of course! What can I help you with?",
        "I'm here to help! What do you need assistance with?"
      ]
    },
    {
      "tag": "search",
      "patterns": [
        "How can I search for shoes?",
        "How can I find shoes on KickFlicker?",
        "How can I look for shoes on KickFlicker?",
        "How can I search for shoes on KickFlicker?",
        "Where can I search for shoes?",
        "Where can I find shoes on KickFlicker?",
        "Where can I look for shoes on KickFlicker?",
        "Where can I search for shoes on KickFlicker?",
        "Can I search for shoes on KickFlicker?",
        "Can I find shoes on KickFlicker?",
        "Can I look for shoes on KickFlicker?",
        "Can I search for shoes on KickFlicker?"
      ],
      "responses": [
        "You can search for shoes on KickFlicker by using the search bar at the top of the page! You can also use our image recognition feature to search for shoes using images! Cool, isn't it?",
        "Searching for shoes on KickFlicker is super easy! Just type what you're looking for in the search bar at the top. Plus, you can use our awesome image recognition feature to find shoes with just a picture!",
        "Looking for shoes? Use the search bar at the top of the page on KickFlicker! And don't forget to try our amazing image recognition feature to search using photos. It's really fun!",
        "Find your perfect pair of shoes by using the search bar at the top of KickFlicker! You can also upload a picture and let our image recognition feature do the magic. Isn't that exciting?"
      ]
    },
    {
      "tag": "buy",
      "patterns": [
        "How can I buy shoes on KickFlicker?",
        "How can I purchase shoes on KickFlicker?",
        "How can I order shoes on KickFlicker?",
        "How can I get shoes on KickFlicker?",
        "Where can I buy shoes on KickFlicker?",
        "Where can I purchase shoes on KickFlicker?",
        "Where can I order shoes on KickFlicker?",
        "Where can I get shoes on KickFlicker?",
        "What is the process to buy shoes on KickFlicker?",
        "What is the process to purchase shoes on KickFlicker?",
        "What is the process to order shoes on KickFlicker?",
        "What is the process to get shoes on KickFlicker?"
      ],
      "responses": [
        "First things first, you need to create an account on KickFlicker. Then, you can browse through the shoes, add them to your cart, and proceed to checkout!",
        "To buy shoes on KickFlicker, start by creating an account. After that, browse the available shoes, add your desired pairs to the cart, and complete the purchase at checkout!",
        "Buying shoes on KickFlicker is easy! Just create an account, browse the selection, add your favorite shoes to the cart, and proceed to checkout!",
        "Create an account on KickFlicker, browse through the shoe collection, add the ones you like to your cart, and then proceed to checkout to complete your purchase!"
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "How can I contact KickFlicker?",
        "How can I reach KickFlicker?",
        "How can I get in touch with KickFlicker?",
        "How can I connect with KickFlicker?",
        "What is the contact information for KickFlicker?",
        "Who do I contact at KickFlicker?",
        "Where can I send a message to KickFlicker?",
        "What is the email address for KickFlicker?",
        "How do I communicate with KickFlicker?",
        "How do I send an inquiry to KickFlicker?"
      ],
      "responses": [
        "You can contact KickFlicker by sending an email to faaizhaikal@gmail.com",
        "Reach out to KickFlicker by sending an email to faaizhaikal@gmail.com",
        "For any inquiries, you can contact KickFlicker by sending an email to faaizhaikal@gmail.com"
      ]
    },
    {
      "tag": "payment",
      "patterns": [
        "How can I pay for shoes on KickFlicker?",
        "What payment methods are accepted on KickFlicker?",
        "How can I make payment on KickFlicker?",
        "What are the payment options on KickFlicker?",
        "Which payment methods can I use on KickFlicker?",
        "How do I pay for my order on KickFlicker?",
        "What forms of payment does KickFlicker accept?",
        "Can I use PayPal on KickFlicker?",
        "Can I pay with a credit card on KickFlicker?",
        "Are debit cards accepted on KickFlicker?"
      ],
      "responses": [
        "KickFlicker accepts various payment methods, including credit cards, debit cards, and PayPal!",
        "You can pay for shoes on KickFlicker using credit cards, debit cards, and PayPal!",
        "KickFlicker supports multiple payment options such as credit cards, debit cards, and PayPal!",
        "On KickFlicker, you can make payments using credit cards, debit cards, and PayPal!"
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "How are shoes delivered on KickFlicker?",
        "What are the delivery options on KickFlicker?",
        "How can I get my shoes on KickFlicker?",
        "How can I receive my shoes on KickFlicker?",
        "What delivery methods are available on KickFlicker?",
        "How does delivery work on KickFlicker?",
        "What are the shipping options on KickFlicker?",
        "How will my shoes be delivered on KickFlicker?",
        "Can I choose delivery options on KickFlicker?",
        "What are the delivery choices on KickFlicker?"
      ],
      "responses": [
        "The delivery of shoes on KickFlicker depends on the seller, but you can usually choose between standard and express delivery options!",
        "Delivery options on KickFlicker vary by seller, but you typically have the choice of standard or express delivery!",
        "On KickFlicker, shoe delivery is managed by the seller, and you can often select either standard or express delivery!",
        "Shoe delivery on KickFlicker is seller-dependent, with standard and express delivery options commonly available!"
      ]
    },
    {
      "tag": "return",
      "patterns": [
        "How can I return shoes on KickFlicker?",
        "What is the return policy on KickFlicker?",
        "How can I get a refund on KickFlicker?",
        "What is the process for returning shoes on KickFlicker?",
        "Can I return shoes on KickFlicker?",
        "How do I return shoes on KickFlicker?",
        "What are the steps to return shoes on KickFlicker?",
        "Is it possible to return shoes on KickFlicker?",
        "How can I initiate a return on KickFlicker?",
        "What do I need to do to return shoes on KickFlicker?"
      ],
      "responses": [
        "The return policy on KickFlicker depends on the seller, but you can usually return shoes within a certain period if they are in their original condition!",
        "Returns on KickFlicker are subject to the seller's policy, but generally, you can return shoes within a specified timeframe if they remain in their original state!",
        "You can typically return shoes on KickFlicker within a certain period, as long as they are in their original condition, but please check the seller's return policy for specifics!",
        "KickFlicker allows returns based on the seller's policy, usually within a set period if the shoes are in their original condition!"
      ]
    },
    {
      "tag": "chat",
      "patterns": [
        "How can I chat with sellers on KickFlicker?",
        "How can I communicate with sellers on KickFlicker?",
        "How can I talk to sellers on KickFlicker?",
        "How can I contact sellers on KickFlicker?",
        "How do I message sellers on KickFlicker?",
        "How do I reach out to sellers on KickFlicker?",
        "How do I start a chat with sellers on KickFlicker?",
        "How do I get in touch with sellers on KickFlicker?",
        "How can I send a message to sellers on KickFlicker?",
        "How can I initiate a chat with sellers on KickFlicker?"
      ],
      "responses": [
        "You can chat with sellers on KickFlicker by clicking on the chat icon on the product page!",
        "To communicate with sellers on KickFlicker, click on the chat icon located on the product page!",
        "Simply click on the chat icon on the product page to start a conversation with sellers on KickFlicker!",
        "To talk to sellers on KickFlicker, use the chat icon found on the product page!"
      ]
    },
    {
      "tag": "review",
      "patterns": [
        "How can I leave a review on KickFlicker?",
        "How can I rate sellers on KickFlicker?",
        "How can I provide feedback on KickFlicker?",
        "How can I review products on KickFlicker?",
        "Where can I leave a review on KickFlicker?",
        "Where can I rate sellers on KickFlicker?",
        "Where can I provide feedback on KickFlicker?",
        "Where can I review products on KickFlicker?",
        "How do I leave a review on KickFlicker?",
        "How do I rate sellers on KickFlicker?",
        "How do I provide feedback on KickFlicker?",
        "How do I review products on KickFlicker?"
      ],
      "responses": [
        "You can leave a review on KickFlicker by going to the product page and clicking on the review section!",
        "To rate sellers on KickFlicker, visit the product page and navigate to the review section!",
        "Providing feedback on KickFlicker is easy! Just go to the product page and click on the review section!",
        "To review products on KickFlicker, head to the product page and find the review section!"
      ]
    },
    {
      "tag": "image",
      "patterns": [
        "How can I search for shoes using images on KickFlicker?",
        "How can I use image recognition on KickFlicker?",
        "How can I find shoes with pictures on KickFlicker?",
        "How can I search for shoes with photos on KickFlicker?",
        "Can I search for shoes using images on KickFlicker?",
        "Is there an image recognition feature on KickFlicker?",
        "Can I find shoes by uploading pictures on KickFlicker?",
        "Does KickFlicker support image-based shoe search?",
        "Can I use photos to search for shoes on KickFlicker?",
        "Is it possible to search for shoes with images on KickFlicker?"
      ],
      "responses": [
        "You can use our image recognition feature by clicking on the camera icon in the search bar and uploading a picture of the shoes you're looking for!",
        "To find shoes using images, click on the camera icon in the search bar and upload a photo of the shoes you want to search for!",
        "Simply click on the camera icon in the search bar and upload an image to search for shoes using our image recognition feature!"
      ]
    },
    {
      "tag": "default",
      "patterns": ["", "I don't know", "I'm not sure", "Maybe", "No", "Yes"],
      "responses": [
        "I'm sorry, I didn't understand that.",
        "Could you please rephrase that?",
        "I'm not sure I follow you.",
        "I'm still learning, can you provide more context?"
      ]
    }
  ]
}
